src/cf/src/AccumulationRegisters/ПотребностиПроизводства/ПотребностиПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПотребностиПроизводства</name>
  <resources>
    <name>Потребность</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Заказано</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Пришло</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>ИзОстатка</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <posting>Allow</posting>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.КоммерческоеПредложение</types>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСWEBСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПодтвердилПроверилОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЗаказаПокупателя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Техкарта</name>
      <type>
        <types>DocumentRef.ТехнологическаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧМатериалы</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиПродукции</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиРодителя</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаЕдиницу</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПоставщику</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.ПредложениеПоставщика</basedOn>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ВидЗаказа</name>
    <type>
      <types>EnumRef.ВидыЗаказовПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>ЗаказПоставщику</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/AccumulationRegisters/ПотребностиПроизводства/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Формирует движения потребностей производства документа. Набор записывается всегда: пустой набор при
// перепроведении стирает прежние движения документа, закупка без заказа на производство движений не даёт.
// Вызывается из ОбработкаПроведения после блокировки (см. ЗаказКлиентаДокументаЗакупки). Автовыпуск при отгрузке
// пишет «ИзОстатка» только при проведении механизмом реализации (E9); без его данных набор не переписывается.
//
// Параметры:
//  ДокОбъект - ДокументОбъект.ЗаказПокупателя, ДокументОбъект.ЗаказПоставщику,
//              ДокументОбъект.ПоступлениеТоваровУслуг, ДокументОбъект.ВозвратПоставщику,
//              ДокументОбъект.ВыпускПродукции - проводимый документ.
//
Процедура СформироватьДвижения(ДокОбъект) Экспорт

	Набор = ДокОбъект.Движения.ПотребностиПроизводства;
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВыпускПродукции") Тогда
		СформироватьДвиженияАвтовыпуска(ДокОбъект, Набор);
		Возврат;
	КонецЕсли;
	Набор.Записывать = Истина;
	Набор.Очистить();
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ЗаказПокупателя") Тогда
		СформироватьДвиженияЗаказаКлиента(ДокОбъект, Набор);
	Иначе
		СформироватьДвиженияЗакупки(ДокОбъект, Набор);
	КонецЕсли;

КонецПроцедуры

// Заказ клиента, под который идёт закупка, - без проверки проведения (её делает проведение после блокировки).
// Допустимы только два пути: основание - заказ клиента; основание - заказ поставщику, чьё основание - заказ
// клиента. У возврата поставщику путь считается от поступления-основания. Цепочка через реализацию не
// рассматривается: она увела бы поступление от покупателя в чужой заказ на производство.
//
// Параметры:
//  ДокОбъект - ДокументОбъект.ЗаказПоставщику, ДокументОбъект.ПоступлениеТоваровУслуг,
//              ДокументОбъект.ВозвратПоставщику - документ закупки.
//
// Возвращаемое значение:
//  ДокументСсылка.ЗаказПокупателя, Неопределено - заказ клиента или Неопределено.
//
Функция ЗаказКлиентаДокументаЗакупки(ДокОбъект) Экспорт

	Основание = ДокОбъект.Основание;
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВозвратПоставщику") Тогда
		Если ТипЗнч(Основание) <> Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Или Не ЗначениеЗаполнено(Основание) Тогда
			Возврат Неопределено;
		КонецЕсли;
		Основание = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "Основание");
	КонецЕсли;
	Возврат ЗаказКлиентаОснования(Основание);

КонецФункции

// Сформирована ли потребность заказа клиента: у заказа есть собственные движения регистра (он проведён как
// заказ на производство). Признак не зависит от текущей опции «Производство»: перепроведение закупок при
// временно выключенной опции не стирает их «Заказано» и «Пришло». Читать под блокировкой регистра по заказу.
//
// Параметры:
//  Заказ - ДокументСсылка.ЗаказПокупателя - заказ клиента.
//
// Возвращаемое значение:
//  Булево - Истина, если по заказу пишутся движения закупки.
//
Функция ЗаказФормируетПотребность(Заказ) Экспорт

	Если Не ЗначениеЗаполнено(Заказ) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат ЕстьДвиженияПоЗаказу(Заказ, Заказ);

КонецФункции

// Заказы клиентов, по которым документ закупки уже записал движения, - для блокировки при перепроведении со
// сменой основания: прежний заказ теряет движения документа.
//
// Параметры:
//  Регистратор - ДокументСсылка - проводимый документ закупки.
//
// Возвращаемое значение:
//  Массив - ДокументСсылка.ЗаказПокупателя.
//
Функция ЗаказыДвиженийДокумента(Регистратор) Экспорт

	Если Не ЗначениеЗаполнено(Регистратор) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Д.Заказ КАК Заказ
	|ИЗ
	|	РегистрНакопления.ПотребностиПроизводства КАК Д
	|ГДЕ
	|	Д.Регистратор = &Регистратор");
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Заказ");

КонецФункции

// Потребность заказа клиента на производство по его табличным частям: материалы с заполненной номенклатурой,
// продукция - номенклатура строки товаров с кодом КодСтрокиПродукции, количество - базовое (обязательство E5).
// Работает и с табличными частями объекта, и с выгрузкой из базы.
//
// Параметры:
//  ТЧТовары    - ТабличнаяЧасть, ТаблицаЗначений - строки с КодСтроки, Номенклатура.
//  ТЧМатериалы - ТабличнаяЧасть, ТаблицаЗначений - строки с КодСтрокиПродукции, Номенклатура, Характеристика, Количество.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Продукция, Материал, Характеристика, Потребность; свёрнута, упорядочена для сравнения.
//
Функция ПотребностьЗаказаКлиента(ТЧТовары, ТЧМатериалы) Экспорт

	Результат = НоваяТаблицаСтрок("Потребность");
	ПродукцияПоКодам = Новый Соответствие;
	Для Каждого СтрокаТоваров Из ТЧТовары Цикл
		Если ПродукцияПоКодам[СтрокаТоваров.КодСтроки] = Неопределено Тогда
			ПродукцияПоКодам.Вставить(СтрокаТоваров.КодСтроки, СтрокаТоваров.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Материал Из ТЧМатериалы Цикл
		Продукция = ПродукцияПоКодам[Материал.КодСтрокиПродукции];
		Если Не ЗначениеЗаполнено(Материал.Номенклатура) Или Не ЗначениеЗаполнено(Продукция) Тогда
			Продолжить;
		КонецЕсли;
		Строка = Результат.Добавить();
		Строка.Продукция = Продукция;
		Строка.Материал = Материал.Номенклатура;
		Строка.Характеристика = Материал.Характеристика;
		Строка.Потребность = Материал.Количество;
	КонецЦикла;
	Результат.Свернуть("Продукция, Материал, Характеристика", "Потребность");
	Результат.Сортировать("Продукция, Материал, Характеристика");
	Возврат Результат;

КонецФункции

// Ключ потребности для сравнения двух состояний заказа: строки по измерениям с количеством.
//
// Параметры:
//  Потребность - ТаблицаЗначений - см. ПотребностьЗаказаКлиента.
//
// Возвращаемое значение:
//  Строка - ключ; равные потребности дают равные ключи.
//
Функция КлючПотребности(Потребность) Экспорт

	Строки = Новый Массив;
	Для Каждого Строка Из Потребность Цикл
		Если Строка.Потребность = 0 Тогда
			Продолжить;
		КонецЕсли;
		КлючСтроки = СтрШаблон("%1|%2|%3|%4", XMLСтрока(Строка.Продукция), XMLСтрока(Строка.Материал),
			XMLСтрока(Строка.Характеристика), XMLСтрока(Строка.Потребность));
		Строки.Добавить(КлючСтроки);
	КонецЦикла;
	Возврат СтрСоединить(Строки, Символы.ПС);

КонецФункции

// Дефицит заказа клиента - «Потребность - Заказано - ИзОстатка» больше нуля - по данным регистра, а не по текущей техкарте.
// Для «Заполнить по потребности» и ввода заказа поставщику на основании заказа на производство.
//
// Параметры:
//  Заказ                 - ДокументСсылка.ЗаказПокупателя - заказ клиента на производство.
//  ИсключитьРегистратор  - ДокументСсылка.ЗаказПоставщику, Неопределено - документ, чьи движения не учитываются
//                          (перезаполняемый заказ поставщику).
//
// Возвращаемое значение:
//  ТаблицаЗначений - Продукция, Материал, Характеристика, Количество - в порядке строк продукции заказа.
//
Функция ДефицитЗаказа(Заказ, ИсключитьРегистратор = Неопределено) Экспорт

	Остатки = ОстаткиЗаказа(Заказ, ИсключитьРегистратор);
	Результат = НоваяТаблицаСтрок("Количество");
	Для Каждого Строка Из Остатки Цикл
		// Взятое автовыпуском из общего остатка заказывать не нужно (E9).
		Дефицит = Строка.Потребность - Строка.Заказано - Строка.ИзОстатка;
		Если Строка.Потребность > 0 И Дефицит > 0 Тогда
			НоваяСтрока = Результат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.Количество = Дефицит;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Что осталось получить по заказу клиента - для ввода поступления на основании заказа на производство:
// «Заказано - Пришло»; если по заказу ничего не заказано - «Потребность - Пришло - ИзОстатка». Свёрнуто по материалу.
//
// Параметры:
//  Заказ - ДокументСсылка.ЗаказПокупателя - заказ клиента на производство.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Материал, Характеристика, Количество (больше нуля).
//
Функция ОстатокКПоступлению(Заказ) Экспорт

	Остатки = ОстаткиЗаказа(Заказ, Неопределено);
	ПоЗаказанному = Остатки.Итог("Заказано") <> 0;
	Результат = НоваяТаблицаСтрок("Количество");
	Для Каждого Строка Из Остатки Цикл
		Если ПоЗаказанному Тогда
			Количество = Строка.Заказано - Строка.Пришло;
		Иначе
			Количество = Строка.Потребность - Строка.Пришло - Строка.ИзОстатка;
		КонецЕсли;
		НоваяСтрока = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "Материал, Характеристика");
		НоваяСтрока.Количество = Количество;
	КонецЦикла;
	Результат.Свернуть("Материал, Характеристика", "Количество");
	ЧислоСтрок = Результат.Количество();
	Для Индекс = 1 По ЧислоСтрок Цикл
		ИндексСтроки = ЧислоСтрок - Индекс;
		Если Результат[ИндексСтроки].Количество <= 0 Тогда
			Результат.Удалить(ИндексСтроки);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Текст отказа ввода закупки на основании заказа клиента без сформированной потребности.
//
// Возвращаемое значение:
//  Строка - текст на языке пользователя.
//
Функция ТекстЗаказБезПотребности() Экспорт

	Возврат НСтр("ru = 'У заказа клиента нет потребности в материалах: закупка вводится по проведённому заказу на производство';
		|fr = 'La commande client n''a pas de besoin en matières : l''achat se saisit sur une commande en production validée';
		|en = 'The customer order has no material requirements: a purchase is entered for a posted production order';
		|es = 'El pedido de cliente no tiene necesidades de materiales: la compra se registra para un pedido contabilizado'");

КонецФункции

// Текст сообщения, когда вся потребность заказа уже заказана.
//
// Возвращаемое значение:
//  Строка - текст на языке пользователя.
//
Функция ТекстПотребностьЗаказана() Экспорт

	Возврат НСтр("ru = 'Потребность заказа клиента в материалах уже заказана';
		|fr = 'Le besoin en matières de la commande client est déjà commandé';
		|en = 'The material requirements of the customer order are already ordered';
		|es = 'Las necesidades de materiales del pedido de cliente ya están pedidas'");

КонецФункции

// Текст сообщения, когда по заказу клиента получать больше нечего.
//
// Возвращаемое значение:
//  Строка - текст на языке пользователя.
//
Функция ТекстПотребностьПолучена() Экспорт

	Возврат НСтр("ru = 'Материалы по заказу клиента уже получены';
		|fr = 'Les matières de la commande client sont déjà reçues';
		|en = 'The materials of the customer order are already received';
		|es = 'Los materiales del pedido de cliente ya se recibieron'");

КонецФункции

// Имя дополнительного свойства документа закупки, в котором блокировка оставляет заказ клиента.
//
// Возвращаемое значение:
//  Строка - имя свойства.
//
Функция ИмяСвойстваЗаказа() Экспорт

	Возврат "ЗаказПотребностейПроизводства";

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Движения «Потребность» заказа клиента на производство.
//
// Параметры:
//  ДокОбъект - ДокументОбъект.ЗаказПокупателя - проводимый заказ.
//  Набор     - РегистрНакопленияНаборЗаписей.ПотребностиПроизводства - набор движений документа.
//
Процедура СформироватьДвиженияЗаказаКлиента(ДокОбъект, Набор)

	Если Не Документы.ЗаказПокупателя.ЗаказПроводится(ДокОбъект.ВидОперации) Тогда
		Возврат;
	КонецЕсли;
	Потребность = ПотребностьЗаказаКлиента(ДокОбъект.ТЧТовары, ДокОбъект.ТЧМатериалы);
	Для Каждого Строка Из Потребность Цикл
		Если Строка.Потребность = 0 Тогда
			Продолжить;
		КонецЕсли;
		Запись = Набор.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(Запись, Строка);
		Запись.Период = ДокОбъект.Дата;
		Запись.Заказ = ДокОбъект.Ссылка;
	КонецЦикла;

КонецПроцедуры

// Движения «ИзОстатка» автовыпуска при отгрузке: материалы, списанные не из партий под заказ (E9). Данные передаёт
// механизм автовыпуска; выпуск, записанный не им, свои движения не переписывает.
//
// Параметры:
//  ДокОбъект - ДокументОбъект.ВыпускПродукции - проводимый автовыпуск.
//  Набор     - РегистрНакопленияНаборЗаписей.ПотребностиПроизводства - набор движений документа.
//
Процедура СформироватьДвиженияАвтовыпуска(ДокОбъект, Набор)

	ИзОстатка = Производство.ИзОстаткаАвтовыпуска(ДокОбъект);
	Если ИзОстатка = Неопределено Тогда
		Набор.Записывать = Ложь;
		Возврат;
	КонецЕсли;
	Набор.Записывать = Истина;
	Набор.Очистить();
	Если ИзОстатка.Заказ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Строка Из ИзОстатка.Строки Цикл
		Если Строка.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		Запись = Набор.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(Запись, Строка, "Продукция, Материал, Характеристика");
		Запись.Период = ДокОбъект.Дата;
		Запись.Заказ = ИзОстатка.Заказ;
		Запись.ИзОстатка = Строка.Количество;
	КонецЦикла;

КонецПроцедуры

// Движения «Заказано» заказа поставщику и «Пришло» поступления (возврат - со знаком минус), распределённые по
// продукции. Закупка под заказ без сформированной потребности движений не даёт (решение владельца 3).
//
// Параметры:
//  ДокОбъект - ДокументОбъект.ЗаказПоставщику, ДокументОбъект.ПоступлениеТоваровУслуг,
//              ДокументОбъект.ВозвратПоставщику - проводимый документ закупки.
//  Набор     - РегистрНакопленияНаборЗаписей.ПотребностиПроизводства - набор движений документа.
//
Процедура СформироватьДвиженияЗакупки(ДокОбъект, Набор)

	// Заказ, найденный до блокировки: движения пишутся только по заблокированному заказу.
	Если ДокОбъект.ДополнительныеСвойства.Свойство(ИмяСвойстваЗаказа()) Тогда
		Заказ = ДокОбъект.ДополнительныеСвойства[ИмяСвойстваЗаказа()];
	Иначе
		Заказ = ЗаказКлиентаДокументаЗакупки(ДокОбъект);
	КонецЕсли;
	Если Не ЗаказФормируетПотребность(Заказ) Тогда
		Возврат;
	КонецЕсли;
	Строки = СтрокиЗакупки(ДокОбъект);
	Если Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ЭтоЗаказПоставщику = ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ЗаказПоставщику");
	Знак = ?(ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВозвратПоставщику"), -1, 1);
	ИмяРесурса = ?(ЭтоЗаказПоставщику, "Заказано", "Пришло");
	Распределение = РаспределитьПоПродукции(Строки, ПределыДокумента(ДокОбъект, Заказ));
	Для Каждого Строка Из Распределение Цикл
		Если Строка.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		Запись = Набор.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(Запись, Строка, "Продукция, Материал, Характеристика");
		Запись.Период = ДокОбъект.Дата;
		Запись.Заказ = Заказ;
		Запись[ИмяРесурса] = Знак * Строка.Количество;
	КонецЦикла;

КонецПроцедуры

// Заказ клиента по основанию закупки: сам заказ клиента или основание заказа поставщику.
//
// Параметры:
//  Основание - ДокументСсылка, Неопределено - основание документа закупки.
//
// Возвращаемое значение:
//  ДокументСсылка.ЗаказПокупателя, Неопределено - заказ клиента или Неопределено.
//
Функция ЗаказКлиентаОснования(Основание)

	Если Не ЗначениеЗаполнено(Основание) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Заказ = Основание;
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Заказ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "Основание");
	КонецЕсли;
	Если ТипЗнч(Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") И ЗначениеЗаполнено(Заказ) Тогда
		Возврат Заказ;
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

// Есть ли у документа активные движения регистра по заказу клиента (по индексу регистратора).
//
// Параметры:
//  Регистратор - ДокументСсылка - документ.
//  Заказ       - ДокументСсылка.ЗаказПокупателя - заказ клиента.
//
// Возвращаемое значение:
//  Булево - Истина, если движения есть.
//
Функция ЕстьДвиженияПоЗаказу(Регистратор, Заказ)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК ПризнакДвижений
	|ИЗ
	|	РегистрНакопления.ПотребностиПроизводства КАК Движения
	|ГДЕ
	|	Движения.Регистратор = &Регистратор
	|	И Движения.Заказ = &Заказ
	|	И Движения.Активность";
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

// Строки закупки для распределения: материал, характеристика, продукция (может быть пустой), количество.
//
// Параметры:
//  ДокОбъект - ДокументОбъект.ЗаказПоставщику, ДокументОбъект.ПоступлениеТоваровУслуг,
//              ДокументОбъект.ВозвратПоставщику - документ закупки.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Продукция, Материал, Характеристика, Количество.
//
Функция СтрокиЗакупки(ДокОбъект)

	Результат = НоваяТаблицаСтрок("Количество");
	СтрокиЗаказаПоставщику = Неопределено;
	Если ТипЗнч(ДокОбъект) <> Тип("ДокументОбъект.ЗаказПоставщику") Тогда
		СтрокиЗаказаПоставщику = СтрокиЗаказаПоставщикуДокумента(ДокОбъект);
	КонецЕсли;
	Для Каждого СтрокаТоваров Из ДокОбъект.ТЧТовары Цикл
		Если Не ЗначениеЗаполнено(СтрокаТоваров.Номенклатура) Или СтрокаТоваров.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		Продукция = ПродукцияСтрокиЗакупки(СтрокаТоваров, СтрокиЗаказаПоставщику);
		Если Продукция = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Строка = Результат.Добавить();
		Строка.Продукция = Продукция;
		Строка.Материал = СтрокаТоваров.Номенклатура;
		Строка.Характеристика = СтрокаТоваров.Характеристика;
		Строка.Количество = СтрокаТоваров.Количество;
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Продукция строки закупки. Строки заказа поставщику, собранные из предварительного заказа (колонка
// ЗаказПоставщику), не участвуют: «Заказано» по ним записал предварительный заказ; так же - строки поступления и
// возврата, которым они соответствуют. Продукция строк поступления и возврата - из строки заказа поставщику
// с тем же кодом строки, номенклатурой и характеристикой.
//
// Параметры:
//  СтрокаТоваров          - СтрокаТабличнойЧасти - строка товаров документа закупки.
//  СтрокиЗаказаПоставщику - Соответствие, Неопределено - см. СтрокиЗаказаПоставщикуДокумента; Неопределено у
//                           самого заказа поставщику.
//
// Возвращаемое значение:
//  СправочникСсылка.Номенклатура, Неопределено - продукция (пустая - распределяется) или Неопределено - строка
//                                                 движений не даёт.
//
Функция ПродукцияСтрокиЗакупки(СтрокаТоваров, СтрокиЗаказаПоставщику)

	Если СтрокиЗаказаПоставщику = Неопределено Тогда
		Если ЗначениеЗаполнено(СтрокаТоваров.ЗаказПоставщику) Тогда
			Возврат Неопределено;
		КонецЕсли;
		Возврат СтрокаТоваров.Продукция;
	КонецЕсли;
	СтрокаЗаказа = СтрокиЗаказаПоставщику[КлючСтрокиЗаказаПоставщику(СтрокаТоваров)];
	Если СтрокаЗаказа = Неопределено Тогда
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	ИначеЕсли СтрокаЗаказа.ИзПредварительного Тогда
		Возврат Неопределено;
	Иначе
		Возврат СтрокаЗаказа.Продукция;
	КонецЕсли;

КонецФункции

// Строки заказа поставщику, по которому введено поступление (или поступление-основание возврата).
//
// Параметры:
//  ДокОбъект - ДокументОбъект.ПоступлениеТоваровУслуг, ДокументОбъект.ВозвратПоставщику - документ закупки.
//
// Возвращаемое значение:
//  Соответствие - ключ КлючСтрокиЗаказаПоставщику, значение Структура: Продукция, ИзПредварительного.
//
Функция СтрокиЗаказаПоставщикуДокумента(ДокОбъект)

	Результат = Новый Соответствие;
	ЗаказПоставщику = ЗаказПоставщикуДокумента(ДокОбъект);
	Если Не ЗначениеЗаполнено(ЗаказПоставщику) Тогда
		Возврат Результат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Т.КодСтроки КАК КодСтроки,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.Продукция КАК Продукция,
	|	Т.ЗаказПоставщику <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка) КАК ИзПредварительного
	|ИЗ
	|	Документ.ЗаказПоставщику.ТЧТовары КАК Т
	|ГДЕ
	|	Т.Ссылка = &ЗаказПоставщику";
	Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Ключ = КлючСтрокиЗаказаПоставщику(Выборка);
		Если Результат[Ключ] = Неопределено Тогда
			ОписаниеСтроки = Новый Структура("Продукция, ИзПредварительного", Выборка.Продукция, Выборка.ИзПредварительного);
			Результат.Вставить(Ключ, ОписаниеСтроки);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Заказ поставщику - основание поступления или основание поступления-основания возврата.
//
// Параметры:
//  ДокОбъект - ДокументОбъект.ЗаказПоставщику, ДокументОбъект.ПоступлениеТоваровУслуг,
//              ДокументОбъект.ВозвратПоставщику - документ закупки.
//
// Возвращаемое значение:
//  ДокументСсылка.ЗаказПоставщику, Неопределено - заказ поставщику или Неопределено.
//
Функция ЗаказПоставщикуДокумента(ДокОбъект)

	Основание = ДокОбъект.Основание;
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВозвратПоставщику") И ЗначениеЗаполнено(Основание) Тогда
		Основание = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "Основание");
	КонецЕсли;
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") И ЗначениеЗаполнено(Основание) Тогда
		Возврат Основание;
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

// Ключ сопоставления строки закупки со строкой заказа поставщику.
//
// Параметры:
//  Строка - СтрокаТабличнойЧасти, ВыборкаИзРезультатаЗапроса - строка с КодСтроки, Номенклатура, Характеристика.
//
// Возвращаемое значение:
//  Строка - ключ.
//
Функция КлючСтрокиЗаказаПоставщику(Строка)

	Возврат СтрШаблон("%1|%2|%3", Строка.КодСтроки, XMLСтрока(Строка.Номенклатура), XMLСтрока(Строка.Характеристика));

КонецФункции

// Пределы распределения по продукции (план E7, п. 12.2).
//
// Параметры:
//  ДокОбъект - ДокументОбъект.ЗаказПоставщику, ДокументОбъект.ПоступлениеТоваровУслуг,
//              ДокументОбъект.ВозвратПоставщику - документ закупки.
//  Заказ     - ДокументСсылка.ЗаказПокупателя - заказ клиента.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Продукция, Материал, Характеристика, Предел - в порядке распределения.
//
Функция ПределыДокумента(ДокОбъект, Заказ)

	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ЗаказПоставщику") Тогда
		Возврат ПределыПоОстаткам(Заказ, ДокОбъект.Ссылка, "Заказано");
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда
		ЗаказПоставщику = ЗаказПоставщикуДокумента(ДокОбъект);
		// По «Заказано» заказа поставщику - только если он сам записал движения по заказу клиента; иначе (заказ
		// поставщику проведён до заказа клиента) - по остаткам заказа клиента.
		Если ЗначениеЗаполнено(ЗаказПоставщику) И ЕстьДвиженияПоЗаказу(ЗаказПоставщику, Заказ) Тогда
			Возврат ПределыПоОснованию(Заказ, ЗаказПоставщику, ДокОбъект.Ссылка, Ложь);
		КонецЕсли;
		Возврат ПределыПоОстаткам(Заказ, ДокОбъект.Ссылка, "Пришло");
	Иначе
		Пределы = ПределыПоОснованию(Заказ, ДокОбъект.Основание, ДокОбъект.Ссылка, Истина);
		ОбратныйПорядок = Пределы.СкопироватьКолонки();
		Для Индекс = 1 По Пределы.Количество() Цикл
			ЗаполнитьЗначенияСвойств(ОбратныйПорядок.Добавить(), Пределы[Пределы.Количество() - Индекс]);
		КонецЦикла;
		Возврат ОбратныйПорядок;
	КонецЕсли;

КонецФункции

// Пределы по остаткам заказа клиента без движений документа: «Потребность - Ресурс», только продукция с
// потребностью - излишек не уходит на продукцию, которой в заказе больше нет.
//
// Параметры:
//  Заказ                - ДокументСсылка.ЗаказПокупателя - заказ клиента.
//  ИсключитьРегистратор - ДокументСсылка - документ закупки, чьи движения не учитываются.
//  ИмяРесурса           - Строка - «Заказано» или «Пришло».
//
// Возвращаемое значение:
//  ТаблицаЗначений - Продукция, Материал, Характеристика, Предел.
//
Функция ПределыПоОстаткам(Заказ, ИсключитьРегистратор, ИмяРесурса)

	Остатки = ОстаткиЗаказа(Заказ, ИсключитьРегистратор);
	Результат = НоваяТаблицаСтрок("Предел");
	Для Каждого Строка Из Остатки Цикл
		Если Строка.Потребность > 0 Тогда
			НоваяСтрока = Результат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.Предел = Строка.Потребность - Строка[ИмяРесурса];
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Пределы по движениям документа-основания закупки. Поступление по заказу поставщику: «Заказано» этого заказа
// минус нетто «Пришло» других поступлений по нему с возвратами по ним (возвраты своего поступления не в счёт).
// Возврат: «Пришло» поступления-основания плюс уже отрицательное «Пришло» других возвратов по нему. Движения
// связанных документов отбираются по индексированному заказу регистра, а не по основаниям документов.
//
// Параметры:
//  Заказ      - ДокументСсылка.ЗаказПокупателя - заказ клиента.
//  Основание  - ДокументСсылка.ЗаказПоставщику, ДокументСсылка.ПоступлениеТоваровУслуг - основание закупки.
//  Ссылка     - ДокументСсылка - проводимый документ.
//  ЭтоВозврат - Булево - проводится возврат поставщику.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Продукция, Материал, Характеристика, Предел - в порядке строк продукции заказа.
//
Функция ПределыПоОснованию(Заказ, Основание, Ссылка, ЭтоВозврат)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Товары.Номенклатура КАК Продукция,
	|	МИНИМУМ(Товары.НомерСтроки) КАК НомерПорядка
	|ПОМЕСТИТЬ ВТПорядок
	|ИЗ
	|	Документ.ЗаказПокупателя.ТЧТовары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Движения.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТПоступления
	|ИЗ
	|	РегистрНакопления.ПотребностиПроизводства КАК Движения
	|ГДЕ
	|	НЕ &ЭтоВозврат
	|	И Движения.Заказ = &Заказ
	|	И Движения.Регистратор <> &Ссылка
	|	И Движения.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|	И ВЫРАЗИТЬ(Движения.Регистратор КАК Документ.ПоступлениеТоваровУслуг).Основание = &Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Движения.Продукция КАК Продукция,
	|	Движения.Материал КАК Материал,
	|	Движения.Характеристика КАК Характеристика,
	|	СУММА(Движения.Предел) КАК Предел
	|ПОМЕСТИТЬ ВТПределы
	|ИЗ
	|	(ВЫБРАТЬ
	|		Основания.Продукция КАК Продукция,
	|		Основания.Материал КАК Материал,
	|		Основания.Характеристика КАК Характеристика,
	|		ВЫБОР
	|			КОГДА &ЭтоВозврат
	|				ТОГДА Основания.Пришло
	|			ИНАЧЕ Основания.Заказано
	|		КОНЕЦ КАК Предел
	|	ИЗ
	|		РегистрНакопления.ПотребностиПроизводства КАК Основания
	|	ГДЕ
	|		Основания.Регистратор = &Основание
	|		И Основания.Заказ = &Заказ
	|		И Основания.Активность
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Поступления.Продукция,
	|		Поступления.Материал,
	|		Поступления.Характеристика,
	|		-Поступления.Пришло
	|	ИЗ
	|		РегистрНакопления.ПотребностиПроизводства КАК Поступления
	|	ГДЕ
	|		Поступления.Заказ = &Заказ
	|		И Поступления.Активность
	|		И Поступления.Регистратор В
	|				(ВЫБРАТЬ
	|					ВТПоступления.Регистратор КАК Регистратор
	|				ИЗ
	|					ВТПоступления КАК ВТПоступления)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВозвратыПоступлений.Продукция,
	|		ВозвратыПоступлений.Материал,
	|		ВозвратыПоступлений.Характеристика,
	|		-ВозвратыПоступлений.Пришло
	|	ИЗ
	|		РегистрНакопления.ПотребностиПроизводства КАК ВозвратыПоступлений
	|	ГДЕ
	|		ВозвратыПоступлений.Заказ = &Заказ
	|		И ВозвратыПоступлений.Активность
	|		И ВозвратыПоступлений.Регистратор ССЫЛКА Документ.ВозвратПоставщику
	|		И ВЫРАЗИТЬ(ВозвратыПоступлений.Регистратор КАК Документ.ВозвратПоставщику).Основание В
	|				(ВЫБРАТЬ
	|					ВТПоступления.Регистратор КАК Регистратор
	|				ИЗ
	|					ВТПоступления КАК ВТПоступления)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Возвраты.Продукция,
	|		Возвраты.Материал,
	|		Возвраты.Характеристика,
	|		Возвраты.Пришло
	|	ИЗ
	|		РегистрНакопления.ПотребностиПроизводства КАК Возвраты
	|	ГДЕ
	|		&ЭтоВозврат
	|		И Возвраты.Заказ = &Заказ
	|		И Возвраты.Активность
	|		И Возвраты.Регистратор <> &Ссылка
	|		И Возвраты.Регистратор ССЫЛКА Документ.ВозвратПоставщику
	|		И ВЫРАЗИТЬ(Возвраты.Регистратор КАК Документ.ВозвратПоставщику).Основание = &Основание) КАК Движения
	|
	|СГРУППИРОВАТЬ ПО
	|	Движения.Продукция,
	|	Движения.Материал,
	|	Движения.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПределы.Продукция КАК Продукция,
	|	ВТПределы.Материал КАК Материал,
	|	ВТПределы.Характеристика КАК Характеристика,
	|	ВТПределы.Предел КАК Предел
	|ИЗ
	|	ВТПределы КАК ВТПределы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПорядок КАК ВТПорядок
	|		ПО ВТПределы.Продукция = ВТПорядок.Продукция
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЕСТЬNULL(ВТПорядок.НомерПорядка, 999999999),
	|	ВТПределы.Материал,
	|	ВТПределы.Характеристика";
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ЭтоВозврат", ЭтоВозврат);
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Остатки заказа клиента без движений документа ИсключитьРегистратор: таблица итогов по заказу плюс движения
// документа с обратным знаком (по индексу регистратора) - при перепроведении прежние движения ещё лежат в базе.
//
// Параметры:
//  Заказ                - ДокументСсылка.ЗаказПокупателя - заказ клиента.
//  ИсключитьРегистратор - ДокументСсылка, Неопределено - документ, чьи движения не учитываются.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Продукция, Материал, Характеристика, Потребность, Заказано, Пришло, ИзОстатка - в порядке строк
//                    продукции заказа (решение владельца 4).
//
Функция ОстаткиЗаказа(Заказ, ИсключитьРегистратор)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Товары.Номенклатура КАК Продукция,
	|	МИНИМУМ(Товары.НомерСтроки) КАК НомерПорядка
	|ПОМЕСТИТЬ ВТПорядок
	|ИЗ
	|	Документ.ЗаказПокупателя.ТЧТовары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СводОстатков.Продукция КАК Продукция,
	|	СводОстатков.Материал КАК Материал,
	|	СводОстатков.Характеристика КАК Характеристика,
	|	СУММА(СводОстатков.Потребность) КАК Потребность,
	|	СУММА(СводОстатков.Заказано) КАК Заказано,
	|	СУММА(СводОстатков.Пришло) КАК Пришло,
	|	СУММА(СводОстатков.ИзОстатка) КАК ИзОстатка
	|ПОМЕСТИТЬ ВТОстатки
	|ИЗ
	|	(ВЫБРАТЬ
	|		Остатки.Продукция КАК Продукция,
	|		Остатки.Материал КАК Материал,
	|		Остатки.Характеристика КАК Характеристика,
	|		Остатки.ПотребностьОстаток КАК Потребность,
	|		Остатки.ЗаказаноОстаток КАК Заказано,
	|		Остатки.ПришлоОстаток КАК Пришло,
	|		Остатки.ИзОстаткаОстаток КАК ИзОстатка
	|	ИЗ
	|		РегистрНакопления.ПотребностиПроизводства.Остатки(, Заказ = &Заказ) КАК Остатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Свои.Продукция,
	|		Свои.Материал,
	|		Свои.Характеристика,
	|		-Свои.Потребность,
	|		-Свои.Заказано,
	|		-Свои.Пришло,
	|		-Свои.ИзОстатка
	|	ИЗ
	|		РегистрНакопления.ПотребностиПроизводства КАК Свои
	|	ГДЕ
	|		Свои.Регистратор = &Регистратор
	|		И Свои.Заказ = &Заказ
	|		И Свои.Активность) КАК СводОстатков
	|
	|СГРУППИРОВАТЬ ПО
	|	СводОстатков.Продукция,
	|	СводОстатков.Материал,
	|	СводОстатков.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОстатки.Продукция КАК Продукция,
	|	ВТОстатки.Материал КАК Материал,
	|	ВТОстатки.Характеристика КАК Характеристика,
	|	ВТОстатки.Потребность КАК Потребность,
	|	ВТОстатки.Заказано КАК Заказано,
	|	ВТОстатки.Пришло КАК Пришло,
	|	ВТОстатки.ИзОстатка КАК ИзОстатка
	|ИЗ
	|	ВТОстатки КАК ВТОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПорядок КАК ВТПорядок
	|		ПО ВТОстатки.Продукция = ВТПорядок.Продукция
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЕСТЬNULL(ВТПорядок.НомерПорядка, 999999999),
	|	ВТОстатки.Материал,
	|	ВТОстатки.Характеристика";
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("Регистратор", ИсключитьРегистратор);
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Распределение строк закупки по продукции (план E7, п. 12.2): сначала строки с явной продукцией, затем
// строки без неё по свободным остаткам пределов. Накопитель общий для строк документа: две строки одного
// материала не закрывают один дефицит дважды.
//
// Параметры:
//  Строки  - ТаблицаЗначений - см. СтрокиЗакупки.
//  Пределы - ТаблицаЗначений - см. ПределыДокумента; дополняется колонкой Распределено.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Продукция, Материал, Характеристика, Количество - свёрнута по измерениям.
//
Функция РаспределитьПоПродукции(Строки, Пределы)

	Результат = НоваяТаблицаСтрок("Количество");
	Пределы.Колонки.Добавить("Распределено", Новый ОписаниеТипов("Число"));
	Для Каждого Строка Из Строки Цикл
		Если ЗначениеЗаполнено(Строка.Продукция) Тогда
			РаспределитьНаПродукцию(Результат, Строка, Пределы);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Строка Из Строки Цикл
		Если Не ЗначениеЗаполнено(Строка.Продукция) Тогда
			РаспределитьПоПорядку(Результат, Строка, Пределы);
		КонецЕсли;
	КонецЦикла;
	Результат.Свернуть("Продукция, Материал, Характеристика", "Количество");
	Возврат Результат;

КонецФункции

// Строка с явной продукцией: всё количество на её строку пределов, если такая есть; иначе движения нет.
//
// Параметры:
//  Результат - ТаблицаЗначений - см. РаспределитьПоПродукции.
//  Строка    - СтрокаТаблицыЗначений - строка закупки.
//  Пределы   - ТаблицаЗначений - пределы с колонкой Распределено.
//
Процедура РаспределитьНаПродукцию(Результат, Строка, Пределы)

	Отбор = Новый Структура("Продукция, Материал, Характеристика", Строка.Продукция, Строка.Материал, Строка.Характеристика);
	Найденные = Пределы.НайтиСтроки(Отбор);
	Если Найденные.Количество() > 0 Тогда
		Найденные[0].Распределено = Найденные[0].Распределено + Строка.Количество;
		ДобавитьРаспределение(Результат, Найденные[0], Строка.Количество);
	КонецЕсли;

КонецПроцедуры

// Строка без продукции: свободные остатки пределов материала по порядку, излишек - на последнюю строку
// (решение владельца 2: фактическое количество). Материала нет в пределах - движения нет.
//
// Параметры:
//  Результат - ТаблицаЗначений - см. РаспределитьПоПродукции.
//  Строка    - СтрокаТаблицыЗначений - строка закупки.
//  Пределы   - ТаблицаЗначений - пределы с колонкой Распределено.
//
Процедура РаспределитьПоПорядку(Результат, Строка, Пределы)

	Отбор = Новый Структура("Материал, Характеристика", Строка.Материал, Строка.Характеристика);
	Найденные = Пределы.НайтиСтроки(Отбор);
	Если Найденные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Остаток = Строка.Количество;
	Для Каждого Предел Из Найденные Цикл
		Часть = Мин(Остаток, Макс(0, Предел.Предел - Предел.Распределено));
		Если Часть > 0 Тогда
			Предел.Распределено = Предел.Распределено + Часть;
			ДобавитьРаспределение(Результат, Предел, Часть);
			Остаток = Остаток - Часть;
		КонецЕсли;
	КонецЦикла;
	Если Остаток > 0 Тогда
		Последний = Найденные[Найденные.ВГраница()];
		Последний.Распределено = Последний.Распределено + Остаток;
		ДобавитьРаспределение(Результат, Последний, Остаток);
	КонецЕсли;

КонецПроцедуры

// Добавляет строку распределения.
//
// Параметры:
//  Результат  - ТаблицаЗначений - см. РаспределитьПоПродукции.
//  Предел     - СтрокаТаблицыЗначений - строка пределов с измерениями.
//  Количество - Число - распределённое количество.
//
Процедура ДобавитьРаспределение(Результат, Предел, Количество)

	Строка = Результат.Добавить();
	ЗаполнитьЗначенияСвойств(Строка, Предел, "Продукция, Материал, Характеристика");
	Строка.Количество = Количество;

КонецПроцедуры

// Пустая таблица строк по измерениям регистра с колонкой количества.
//
// Параметры:
//  ИмяКоличества - Строка - имя колонки количества.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Продукция, Материал, Характеристика и колонка количества.
//
Функция НоваяТаблицаСтрок(ИмяКоличества)

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Продукция", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Таблица.Колонки.Добавить("Материал", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Таблица.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Таблица.Колонки.Добавить(ИмяКоличества, Метаданные.ОпределяемыеТипы.Количество.Тип);
	Возврат Таблица;

КонецФункции

#КонецОбласти
